### PYTHON TRAINING NOTEBOOKS - DATAFRAMES

#### Created by Ugur URESIN - AI Engineer, Data Scientist
Mail: uresin.ugur@gmail.com

#### LIBRARY IMPORT

In [8]:
import os
import math
import numpy as np
import pandas as pd

### DataFrame OPERATIONS

#### WORKING DIRECTORY OPERATIONS

In [9]:
## SHOW CURRENT WD
os.getcwd()

'C:\\Users\\uuresin\\Desktop\\MyGIT\\Training-Python'

In [10]:
## CHANGE THE WD
#path="/Users/UGUR/Desktop/mycodes"
#os.chdir(path)  #to set the path as wd

#### DATA IMPORT AND INITIAL CHECK

In [11]:
df = pd.read_csv('./data/house_prices.csv')

In [13]:
## SHOW '3' SAMPLE ROWS (default=1)
df.sample(3)

      house_id neighborhood  area  bedrooms  bathrooms      style    price
5604       850            B  4457         6          4  victorian  2210296
2354      6915            B  2952         5          3  victorian  1468179
1009      6269            C  1185         3          2      ranch   306351

In [14]:
## SHOW 'FIRST 3' ROWS (default=5)
df.head(3)

   house_id neighborhood  area  bedrooms  bathrooms      style    price
0      1112            B  1188         3          2      ranch   598291
1       491            B  3512         5          3  victorian  1744259
2      5952            B  1134         3          2      ranch   571669

In [15]:
## SHOW 'LAST 3' ROWS (default=5)
df.tail(3)

      house_id neighborhood  area  bedrooms  bathrooms      style   price
6025      5894            B  1518         2          1      lodge  760829
6026      5591            C  2270         4          2      ranch  575515
6027      6211            C  3355         5          3  victorian  844747

In [16]:
## SHOW BASIC INFO
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6028 entries, 0 to 6027
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   house_id      6028 non-null   int64
 1   neighborhood  6028 non-null   object
 2   area          6028 non-null   int64
 3   bedrooms      6028 non-null   int64
 4   bathrooms     6028 non-null   int64
 5   style         6028 non-null   object
 6   price         6028 non-null   int64
dtypes: int64(5), object(2)
memory usage: 329.8+ KB

In [17]:
## SHOW DESCRIPTIVE STATISTICS
df.describe()

          house_id         area     bedrooms    bathrooms         price
count  6028.000000  6028.000000  6028.000000  6028.000000  6.028000e+03
mean   4110.536828  2136.849038     3.717651     2.158261  7.542079e+05
std    2251.834665  1237.481101     1.704650     1.169621  5.236731e+05
min     200.000000     0.000000     0.000000     0.000000  1.216700e+04
25%    2167.500000  1225.000000     3.000000     2.000000  3.641350e+05
50%    4120.500000  1826.000000     4.000000     2.000000  6.357590e+05
75%    6070.250000  3129.000000     5.000000     3.000000  9.666752e+05
max    7999.000000  7447.000000     8.000000     5.000000  3.684602e+06

In [18]:
## SHOW CORRELATION BETWEEN VARIABLES
df.corr()

           house_id      area  bedrooms  bathrooms     price
house_id   1.000000  0.005591  0.008959   0.011725  0.005768
area       0.005591  1.000000  0.901623   0.891481  0.823454
bedrooms   0.008959  0.901623  1.000000   0.972768  0.743435
bathrooms  0.011725  0.891481  0.972768   1.000000  0.735851
price      0.005768  0.823454  0.743435   0.735851  1.000000

#### DATA GROUPING EXAMPLES

In [19]:
## GROUP THE ROWS BASED on 'bedrooms' & CALCULATE THE MEANS of THE CORRESPONDING PRICES
df.groupby(['bedrooms'])['price'].mean()

bedrooms
0    2.895395e+05
1    7.448761e+04
2    4.291953e+05
3    4.624925e+05
4    7.077788e+05
5    1.141981e+06
6    1.323303e+06
7    1.600795e+06
8    1.985054e+06
Name: price, dtype: float64

In [20]:
## GROUPING on 'bedrooms' and 'bathrooms' & CALCULATE THE MEANS OF THE CORRESPONDING PRICES
df.groupby(['bedrooms','bathrooms'])['price'].mean()

bedrooms  bathrooms
0         0            2.895395e+05
1         0            7.448761e+04
2         1            4.291953e+05
3         2            4.624925e+05
4         2            7.077788e+05
5         3            1.141981e+06
6         4            1.323303e+06
7         4            1.600795e+06
8         5            1.985054e+06
Name: price, dtype: float64

In [21]:
## END OF THE CHAPTER ##